exports.seed = function (knex) {
  // Deletes ALL existing entries
  return knex("howtoplay")
    .del()
    .then(function () {
      // Inserts seed entries
      return knex("howtoplay").insert([
        {
          howtoplay_id: 1,
          machine_group_id: "1",
          muscles:"กล้ามเนื้อหัวใจ ขา แขน ท้อง",
          detail:
            "1.  ยืนบนเครื่องวิ่ง กดปุ่ม  Start <br/> 2. เครื่องจะเริ่มทำงาน กดที่คำว่า Fast / Slow ปรับความเร็วตามต้องการ <br/> 3. ควรเดินในความเร็วปกติเพื่ออบอุ่นร่างกายก่อนเริ่มวิ่งจริงๆ ราว 5 นาที แล้วค่อยๆ ปรับความเร็วในการวิ่งเพิ่มมากขึ้นอย่างช้าๆ เมื่อเริ่มวิ่งไปได้ราว 15 นาที สามารถเพิ่มระดับความเร็วได้เรื่อยๆ จนถึงระดับที่วิ่งแล้วเหนื่อยหอบ แต่ยังพอพูดได้เป็นคำๆ เมื่อถึงจุดนั้นให้หยุดการเพิ่มความเร็ว แล้ววิ่งในระดับความเร็วนั้นไปเรื่อยๆ จนกว่าจะเริ่มไม่ไหว จึงค่อยๆ ลดความเร็วลงมาจนถึงจุดที่เดินได้ หากยังพอไหวเมื่อเดินจนหายเหนื่อย ก็ค่อยๆ เร่งความเร็วเพื่อวิ่งต่อได้",
          video_path: "www.google.com",
          note:"* หมายเหตุ ใกล้ครบเวลาที่กำหนด ควรลดความเร็วเพื่อให้ร่างกายปรับสู่สภาพปกติ"
        },
        {
          howtoplay_id: 2,
          machine_group_id: "2",
          muscles:"กล้ามเนื้อหลังช่วงล่าง (Elector)",
          detail: "1. ปรับระดับความสูงของเบาะที่รองรับน้ำหนักให้อยู่ระดับ สะโพกหรือเอว <br/> 2. ขึ้นไปยืนบนที่พักเท้าในลักษณะคว่ำหน้าใช้ข้อเท้าด้านหลังหรือบริเวณเอ็นร้อยหวายไว้ใต้เบาะ ที่ล็อคเท้า <br/> 3. มือทั้ง 2 ข้าง แตะไว้บริเวณขมับทั้ง 2 ข้าง <br/> 4. ก้มตัวลงไปให้มากที่สุด ออกแรงจากหลัง ยกลำตัวขึ้นมาในลักษณะหลังตรงกับขาทั้ง 2 ข้าง ห้ามไม่ให้เกินมุม 180 องษา จะทำให้หลังแอ่น อาจเกิดการบาดเจ็บของหลังได้ ทำซ้ำจนครบเซท",
          video_path: "www.google.com",
          breath:"1. ขณะที่ก้มตัวลงให้หายใจเข้า <br/> 2. ขณะที่ออกแรงยกลำตัวขึ้นให้หายใจออก"
        },
        {
          howtoplay_id: 3,
          machine_group_id: "3",
          muscles:"กล้ามเนื้อหัวใจ ขา แขน หลังด้านล่าง",
          detail: "1. สำหรับจักรยานนั่งพิง ก่อนเล่นปรับเบาะเลื่อนๆเข้าออก จะได้ระยะพอดีกับผู้เล่น ท่าเล่นขางอทำมุม 45 องศา เป็นระยะการปั่นที่ถูกต้องไม่ทำให้ปวดเข่า การปั่นต้องรักษาความเร็วของรอบการปั่นไม่ต่ำกว่า 50 – 60 รอบต่อนาที ใช้เวลาเล่นอย่าง 30 – 45 นาที <br/>2. เริ่มปั่น โปรแกรมเริ่มทำงาน <br/>3. ควรออกกำลังกายควบคุมความเหนื่อยไม่น้อยกว่า 55 - 65 % ของความเหนื่อยสูงสุดของแต่ละอายุผู้เล่น ถึงจะได้ประโยชน์สูงสุด เหมาะกับคนทั่วไป ผู้ที่มีน้ำหนักตัวมาก และต้องการอออกกำลังกายเพื่อลดความดันได้ ",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 4,
          machine_group_id: "4",
          muscles:"กล้ามเนื้อหัวใจ ขา แขน หลัง และหัวไหล่",
          detail: "การเดินบนลู่เดินวงรี สามารถทำการเลือกเดินได้ทั้งด้านหน้า หรือเดินถอยหลังตามถนัด โดยที่มือจะต้องจับบาร์ทั้งสองข้าง เพื่อทำการออกแรงดันออกจากตัวและดึงเข้าหาตัว สร้างกล้ามเนื้อได้ทั้งช่วงบนและช่วงล่าง ซึ่งการออกกำลังกายด้วยลู่เดินวงรี ควรออกกำลังกายอย่างน้อยวันละ 30 นาที",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 5,
          machine_group_id: "5",
          detail: "1. เปิดสวิตซ์ด้านหลังของตัวเครื่อง <br/>2. กดปุ่มสีเขียว ตัว P เครื่องจะเริ่มสั่น <br/>3. ปรับความเร็วใช้เครื่องหมาย + หรือ – <br/>4. เครื่องจะถูกตั้งเวลาไว้ที่ 10 นาที <br/>5. เมื่อต้องการหยุดให้กดปุ่มสีแดง",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 6,
          machine_group_id: "6",
          muscles:"กล้ามเนื้อต้นขาด้านหน้า (Quadriceps & Gluteus) ",
          detail: "1. ปรับเบาะให้เหมาะสมกับสรีระฝ่าเท้าทั้งสองข้างเหยียบวางบนแผ่นยันสะโพก หลังและศีรษะ แนบชิดเบาะตลอดเวลาที่ฝึก <br/>2. มือทั้งสองข้างจับจับแกนมือจับด้านข้างสะโพกเพื่อช่วยในการทรงตัว <br/>3. ออกแรงเหยียดขาไปข้างหน้าให้และผ่อนกลับมายังจัดเริ่มต้นโดยไม่ให้แผ่นเหล็กกระทบกัน แล้วปฏิบัติซ้ำๆ จนครบจำนวน ",
          video_path: "www.google.com",
          breath:"1. จังหวะเหยียดเหยียดขาไปข้างหน้าให้หายใจออก <br/>2. ขณะที่ผ่อนแรงกลับด้านหลังพร้อมกับการหายใจเข้า"
        },
        {
          howtoplay_id: 7,
          machine_group_id: "7",
          muscles:"กล้ามเนื้อหน้าท้อง (Abdominal)",
          detail: "1. ปรับเบาะให้เหมาะสมกับความยาวของขาวางเท้าในที่พักเท้า <br/>2. นั่งตัวตรงมือทั้งสองข้างจับที่คานระดับเหนืออก <br/>3. ออกแรงจากหน้าท้องก้มลงไปด้านหน้าให้มากที่สุดนับจังหวะ 1-2 และในจังหวะที่เอนตัว กลับคืนนับจังหวะการนับ 1-2-3-4 ปฏิบัติซ้ำให้ครบจำนวน",
          video_path: "www.google.com",
          breath:"1.ขณะออกแรงก้มตัวลงให้หายใจออก <br/> 2.ขณะที่เอนตังกลับไปยังจุดเริ่มต้นหรือขณะผ่อนแรงให้หายใจเข้า"
        },
        {
          howtoplay_id: 8,
          machine_group_id: "8",
          muscles:"กล้ามเนื้ออกส่วนกลาง (Pectorals Major)",
          detail: "1. นั่งหลังตรง ชิดกับเบาะ หน้าตรง <br/>2. มือจับทั้งสองข้าง ออกแรงผลัก ขณะออกแรง ให้หายใจออกดึงกลับให้หายใจเข้า ",
          video_path: "www.google.com",
          breath:"1. ขณะที่ดันแขนไปด้านหน้าให้หายใจออก <br/> 2. ขณะที่ผ่อนแรงกลับให้หายใจเข้า"
        },
        {
          howtoplay_id: 9,
          machine_group_id: "9",
          muscles:"ต้นแขนด้านหน้า (Biceps)",
          detail: " 1. ปรับเบาะนั่งให้พอดีกับตัวให้อกติดเบาะรอง <br/>2. วางแขนทั้งสองข้างลงบนเบาะ ห่างกันประมาณช่วงหัวไหล่ <br/>3. จับ Hand Grip ลักษณะหงายมือขึ้น หลังตรง หน้ามองตรงออกแรงพับแขนขึ้นประมาณ 90 องศา <br/> 4. ขณะออกแรงยกให้หายใจออกทางปาก ขณะผ่อนแรงลงให้หายใจเข้า ",
          video_path: "www.google.com",
          breath:"1. ขณะออกแรงดึงแขนขึ้นให้หายใจออก <br/>2. ขณะที่ผ่อนแรงเหยียดแขนกลับให้หายใจเข้า"
        },
        {
          howtoplay_id: 10,
          machine_group_id: "10",
          muscles:"กล้ามเนื้อหัวใจ ขา แขน หลังด้านล่าง ",
          detail: "1. ก่อนเล่นปรับเบาะให้อยู่ในระดับสะโพก จะได้ระยะพอดีกับผู้เล่น ท่าเล่นขางอทำมุม 45 องศา เป็นระยะการปั่นที่ถูกต้องไม่ทำให้ปวดเข่า การปั่นต้องรักษาความเร็วของรอบการปั่นไม่ต่ำกว่า 50 – 60 รอบต่อนาที ใช้เวลาเล่นอย่าง 30 – 45 นาที <br/> 2. เริ่มปั่น โปรแกรมเริ่มทำงาน <br/>3. ควรออกกำลังกายควบคุมความเหนื่อยไม่น้อยกว่า 55 - 65 % ของความเหนื่อยสูงสุดของแต่ละอายุผู้เล่น ถึงจะได้ประโยชน์สูงสุด เหมาะกับคนทั่วไป ผู้ที่มีน้ำหนักตัวมาก และต้องการอออกกำลังกายเพื่อลดความดันได้",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 11,
          machine_group_id: "11",
          detail: "11.1 ท่าบริหารต้นแขน (Two Arm Ext.) <br/> กล้ามเนื้อที่ใช้ กล้ามเนื้อต้นแขนด้านหลัง (Triceps) <br/> วิธีการใช้งาน ยืนหย่อนเข่าเล็กน้อยหลังตรง มือทั้งสองข้างถือดัมบ์เบลล์ชูขึ้นเหมือศีรษะ จากนั้นพับแขนลงมาบริเวณ กลางหลัง แล้วเหยียดแขนขึ้นเหนือศีรษะกลับท่าเดิม ทำจนครบเซท <br/>11.2 ท่า Dumbbell Curl <br/> กล้ามเนื้อที่ใช้ Biceps Brachialis, Brachioradialis <br/>ยืนตรงเข่างอเล็กน้อยหงายฝ่ามือ ถือดัมเบลล์ห้อยลงสุดแขนบริเวณด้านหน้าต้นขาโดยให้มือทั้ง สองห่างกันประมาณช่วงไหล่ จากนั้นพับแขนยกดัมเบลล์ขึ้นมาหาหัวไหล่ โดยให้ข้อศอกแนบ ล าตัวตลอดเวลา (หายใจออก) แล้วลดดัมเบลล์กลับไปที่เดิม (หายใจเข้า) ทำซ้ำจนครบ จำนวนครั้งและเซทที่ต้องการ",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 12,
          machine_group_id: "12",
          detail: "Lower Back วางเท้าที่แท่นเหยียบ มือสองข้างจับที่ตัวเครื่อง ค่อยๆเหยียดแขนให้ตึง จะช่วยบริหารหลังส่วนล่าง ทำค้างไว้ 8 วินาที ทำทั้งหมด 4 รอบ <br/> Hamstring มือจับที่เครื่อง เหยียดขาออกทีละข้าง ช่วยยืดในส่วนของต้นขาด้านหลัง ทำค้างไว้ 8 วินาที ทำทั้งหมด 4 รอบ",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 13,
          machine_group_id: "13",
          muscles:"กล้ามเนื้ออกส่วนกลาง (Pectorals Major)",
          detail: "ท่า Bench Press เริ่มต้นจากการนอนหงายหน้าลงบนเบาะ ในเครื่อง Smith Machine เท้าวางสนิทติดกับพื้น หงายมือทั้งสองข้างขึ้น จับบาร์เบลด้วยความกว้างกว่าหัวไหล่เล็กน้อย จากนั้นหมุนบาร์เบลออกมาจากที่พัก ในลักษณะที่แขนตึง แต่ไม่ล็อกข้อศอก เป็นท่าเตรียมฝึกท่า Smith Machine Bench Press <br/>1.ค่อยๆคลายกล้ามเนื้อหน้าอก ออก งอแขน ลดบาร์เบลลงจนแตะยอดอก โดยให้แขนทำมุมประมาณ 70 องศากับลำตัว พร้อมกับสูดลมหายใจเข้าจนสุด <br/>2.จากนั้นเริ่มออกแรงเกร็งกล้ามเนื้อหน้าอกเพื่อยกบาร์เบลขึ้นจนสุดพิสัย เพื่อกลับสู่ท่าเตรียม พร้อมกับปล่อยลมหายใจออกจนสุด นับเป็น 1 ครั้ง",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 14,
          machine_group_id: "14",
          muscles:"กล้ามเนื้อหัวใจ ขา สะโพก",
          detail: "ขึ้นไปยืนที่เครื่อง มือสองข้างจับบาร์ ออกแรงที่ขาข้างหนึ่งเหยียบลงแล้วสลับข้าง เครื่องจะเริ่มทำงาน แล้วเลือกความหนืดที่บาร์ที่เครื่องหมาย + หรือ - ทำซ้ำไปเรื่อยๆออกอย่างน้อยวันละ 30 นาที",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 15,
          machine_group_id: "15",
          detail: "ขึ้นไปนั่งที่เครื่อง แล้วกดที่ปุ่ม Power เพื่อเปิดเครื่อง แล้วเลือกโหมดที่รีโมทตามต้องการซึ่งมี 3 โหมดให้เลือก คือ RELAX , THERAPY และ ARI แล้วเครื่องจะเริ่มทำงานเครื่องจะตั้งเวลาไว้ 15 นาที ถ้าต้องการหยุดก่อนให้กดที่คำว่า Stop ตรงข้างที่วางแขน",
          video_path: "www.google.com",
        },
        {
          howtoplay_id: 16,
          machine_group_id: "16",
          muscles:"กล้ามเนื้ออกส่วนบน",
          detail: "1. ยกตัวให้ลอยบนบาร์คู่ เหยียดแขนจนตึง แต่ไม่ล็อกข้อศอก แอ่นอก <br/>2. ค่อยๆลดลำตัวลง ในลักษณะที่ศอกกางออกไปทางด้านข้างลำตัว จนกล้ามเนื้ออกถูกเหยียดสุด <br/>3. หายใจเข้า และออกแรงเกร็งกล้ามเนื้ออก จากนั้นยกตัวขึ้นเพื่อกลับสู่ท่าเตรียม จึงปล่อยลมหายใจ <br/>4. ทุกกระบวนการให้นับเป็น 1 ครั้ง ทำ 8-12 ครั้ง ต่อ 1 เซ็ท ให้ทำ 4 เซ็ท ",
          video_path: "www.google.com",
        },
      ]);
    });
};
